title: DHCP Spoofing (Abnormal DHCP Server Usage)
id: 2
description: Sigma rule can be used to detect abnormal DHCP Server usage. DHCP Servers that are in use needs to be identified in order to know 
the normal operation, then abnormal behaviors can be identified.
references:
    - https://attack.mitre.org/techniques/T1557/003/
tags:
    - Adversary-in-the-Middle: DHCP Spoofing
    - T1557.003
status: stable
author: Ali Coluk
date: 2022/05/13
modified: 2022/05/13
logsource:
    product: windows
detection:
    selection:
        Event Name|contains:
            - 'Client IP Lease Denied'
            - 'Client IP Lease Renew'
    condition: selection
falsepositives:
    - DHCP processes with known DHCP Servers.
level: medium

